<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"9e5abe7ce5bb03137d0bc354a4ce8d6ae1761f28ee5686b37d91d4f821f33b18","plan_job_ref":"Job Terraform plan (OIDC) #14 at https://github.com/hackforla/incubator/actions/runs/13484970782","plan_out_hash":"4e40025581537dd11200742e19abb4b497aba68b961f4b114c4069e63049c496","plan_hash":"cb0c77a70486abdc68c8e89f5d09bc665b234b4956e62fc112e3f5bdc708db28","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.people-depot.module.people_depot_backend_stage_service.aws_ecs_service.fargate[0] will be updated in-place
!~  resource "aws_ecs_service" "fargate" {
        id                                 = "arn:aws:ecs:us-west-2:035866691871:service/incubator-prod/people-depot-backend-dev"
        name                               = "people-depot-backend-dev"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:us-west-2:035866691871:task-definition/people-depot-backend-dev:16" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # module.people-depot.module.people_depot_backend_stage_service.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
!~      arn                      = "arn:aws:ecs:us-west-2:035866691871:task-definition/people-depot-backend-dev:16" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-west-2:035866691871:task-definition/people-depot-backend-dev" -> (known after apply)
!~      container_definitions    = (sensitive value) # forces replacement
!~      enable_fault_injection   = false -> (known after apply)
!~      id                       = "************************" -> (known after apply)
!~      revision                 = 16 -> (known after apply)
-       tags                     = {} -> null
!~      tags_all                 = {} -> (known after apply)
#        (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan (OIDC) #14](https://github.com/hackforla/incubator/actions/runs/13484970782)